'''
009일차-실습-5
------------------------------------------------------------------
<문제>, <배경설명>, <요구사항>, <실행결과> 를 충족하는 실습을 수행하고 결과를 제출하세요.
------------------------------------------------------------------
<문제>
제시된 리스트의 요소들의 값 중에서 지정된 값(조건에 맞는 값)을 찾아 
새로운 리스트를 만드는 프로그램을 작성하세요

------------------------------------------------------------------
<코딩조건1>
다음의 message 리스트의 요소 중에서 'spam'요소만 추출하여 spam_list를 만드세요.
message= ['spam', 'ham','spam', 'ham', 'spam', 'spum', stam', 'spam']

------------------------------------------------------------------
<코딩조건2>
List Comprehension을 이용하세요.

------------------------------------------------------------------
<실행결과>
message :  ['spam', 'ham', 'spam', 'ham', 'spam', 'spum', 'stam', 'spam']
spam_list :  ['spam', 'spam', 'spam', 'spam']

------------------------------------------------------------------
이상의 실습결과를 techmr@daum.net; ty@doublerock.io 메일로 전송하세요.
메일제목은 '009일차-실습-5-완료' 라고 지정하세요.
'''

message = ['spam', 'ham', 'spam', 'ham', 'spam', 'spum', 'stam', 'spam']
spam_list = [i for i in message if i == 'spam']

print(f'message: {message}')
print(f'spam_list{spam_list}')