'''
006일차-실습-3
------------------------------------------------------------------
<문제>, <배경설명>, <요구사항>, <실행결과> 를 충족하는 실습을 수행하고 결과를 제출하세요.
------------------------------------------------------------------
<문제 >
실습-2-해답코드를 보고 반복문 표그리기를 종이와연필(태블릿과 전자펜 가능)로 수행하세요.
sum = 0   
for i in range(10 , 0 , -1) :
    sum += i
print("10 ~ 1 까지의 합 : ",sum )

------------------------------------------------------------------
<배경설명>
- 반복문의 운행 상황을 인식하는 실습습입니다.

------------------------------------------------------------------
<요구사항1>
- 아래의 <실행결과>와 동일해야하며, 실행결과스샷을 메일본문에 추가(첨부파일안됨) 하세요.


------------------------------------------------------------------
<실행결과>


------------------------------------------------------------------
이상의 실습결과를 techmr@daum.net; ty@doublerock.io 메일로 전송하세요.
메일제목은 '006일차-실습-3-완료' 라고 지정하세요.
'''